books/books-java/books-web-services/soa-aplicado/soa-aplicado-cap-02/src/main/resources/wsdl.xml

<definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" 
             xmlns:wsp="http://www.w3.org/ns/ws-policy" 
             xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" 
             xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" 
             xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" 
             xmlns:tns="http://application.server.fernando.com.br/" 
             xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
             xmlns="http://schemas.xmlsoap.org/wsdl/" 
             targetNamespace="http://application.server.fernando.com.br/" name="livros">

	<!-- Este arquivo e esquema do web service listarLivros e sua resposta -->
	<!-- Logo as mensagens devem estar de acordo com este esquema -->
	<types>
		<xsd:schema>
			<!-- Aqui temos a importacao de outro esquema, o esquema da mensagem do web service listarLivro (veja o arquivo esquema mensagem.xml) -->
			<xsd:import namespace="http://application.server.fernando.com.br/" schemaLocation="http://localhost:8080/soa-aplicado/livros?xsd=1" />
		</xsd:schema>
	</types>

	<!-- Temos a mensagem de listarLivros -->
	<message name="listarLivros">
		<part name="parameters" element="tns:listarLivros" />
	</message>
	<!-- A mensagem de resposta de listarLivros -->
	<message name="listarLivrosResponse">
		<part name="parameters" element="tns:listarLivrosResponse" />
	</message>
	<!-- Temos a mensagem de listarLivrosPaginacao -->
	<message name="listarLivrosPaginacao">
		<part name="parameters" element="tns:listarLivrosPaginacao" />
	</message>
	<!-- A mensagem de resposta de listarLivrosPaginacao -->
	<message name="listarLivrosPaginacaoResponse">
		<part name="parameters" element="tns:listarLivrosPaginacaoResponse" />
	</message>	

	<!-- Definicao das operacoes do servico -->
	<portType name="ListagemLivros">
		<operation name="listarLivros">
			<input wsam:Action="http://application.server.fernando.com.br/ListagemLivros/listarLivrosRequest" message="tns:listarLivros" />
			<output wsam:Action="http://application.server.fernando.com.br/ListagemLivros/listarLivrosResponse" message="tns:listarLivrosResponse" />
		</operation>
		<operation name="listarLivrosPaginacao">
			<input wsam:Action="http://application.server.fernando.com.br/ListagemLivros/listarLivrosPaginacaoRequest" message="tns:listarLivrosPaginacao" />
			<output wsam:Action="http://application.server.fernando.com.br/ListagemLivros/listarLivrosPaginacaoResponse" message="tns:listarLivrosPaginacaoResponse" />
		</operation>
	</portType>

	<!-- soap: binding define o tipo de protocolo, neste caso o SOAP -->
	<!-- operation: modelos de traficos da mensagem -->
	<binding name="ListagemLivrosPortBinding" type="tns:ListagemLivros">
		<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document" />
		<operation name="listarLivros">
			<soap:operation soapAction="" />
			<input>
				<soap:body use="literal" />
			</input>
			<output>
				<soap:body use="literal" />
			</output>
		</operation>
		<operation name="listarLivrosPaginacao">
			<soap:operation soapAction="" />
			<input>
				<soap:body use="literal" />
			</input>
			<output>
				<soap:body use="literal" />
			</output>
		</operation>
	</binding>

	<!-- A url do servico -->
	<service name="livros">
		<port name="ListagemLivrosPort" binding="tns:ListagemLivrosPortBinding">
			<soap:address location="http://localhost:8080/soa-aplicado/livros" />
		</port>
	</service>

</definitions>