books/books-java/books-web-services/soa-aplicado/soa-aplicado-cap-02/src/main/resources/requestListarLivros.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
                  xmlns:app="http://application.server.fernando.com.br/">
	
	<soapenv:Header />
	
	<soapenv:Body>
		<app:listarLivros />
	</soapenv:Body>
	
</soapenv:Envelope>